; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	image3 - mode
	spectrograph1 - mode
	infrared2 - mode
	image0 - mode
	GroundStation2 - direction
	Star3 - direction
	GroundStation4 - direction
	Star0 - direction
	GroundStation1 - direction
	Planet5 - direction
	Star6 - direction
	Star7 - direction
	Planet8 - direction
	Star9 - direction
	Phenomenon10 - direction
	Planet11 - direction
	Phenomenon12 - direction
	Star13 - direction
	Planet14 - direction
	Phenomenon15 - direction
	Phenomenon16 - direction
)
(:init
	(supports instrument0 spectrograph1)
	(supports instrument0 infrared2)
	(calibration_target instrument0 GroundStation4)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet8)
	(supports instrument1 spectrograph1)
	(supports instrument1 infrared2)
	(supports instrument1 image0)
	(calibration_target instrument1 Star0)
	(supports instrument2 infrared2)
	(supports instrument2 image3)
	(calibration_target instrument2 GroundStation1)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Phenomenon12)
)
(:goal (and
	(pointing satellite0 GroundStation2)
	(pointing satellite1 Star13)
	(have_image Planet5 spectrograph1)
	(have_image Star6 spectrograph1)
	(have_image Star7 spectrograph1)
	(have_image Planet8 spectrograph1)
	(have_image Star9 spectrograph1)
	(have_image Phenomenon10 infrared2)
	(have_image Planet11 image3)
	(have_image Phenomenon12 image0)
	(have_image Star13 image3)
	(have_image Planet14 image3)
	(have_image Phenomenon15 spectrograph1)
	(have_image Phenomenon16 image3)
))

)

; plan
1. (turn_to satellite1 star0 phenomenon12)
   deleted: (pointing satellite1 phenomenon12)
   added: (pointing satellite1 star0)
   goals met: 0 of 14
2. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 0 of 14
3. (calibrate satellite1 instrument1 star0)
   added: (calibrated instrument1)
   goals met: 0 of 14
4. (turn_to satellite1 planet5 star0)
   deleted: (pointing satellite1 star0)
   added: (pointing satellite1 planet5)
   goals met: 0 of 14
5. (take_image satellite1 planet5 instrument1 spectrograph1)
   added: (have_image planet5 spectrograph1)
   goals met: 1 of 14
6. (turn_to satellite1 phenomenon15 planet5)
   deleted: (pointing satellite1 planet5)
   added: (pointing satellite1 phenomenon15)
   goals met: 1 of 14
7. (take_image satellite1 phenomenon15 instrument1 spectrograph1)
   added: (have_image phenomenon15 spectrograph1)
   goals met: 2 of 14
8. (turn_to satellite1 phenomenon12 phenomenon15)
   deleted: (pointing satellite1 phenomenon15)
   added: (pointing satellite1 phenomenon12)
   goals met: 2 of 14
9. (take_image satellite1 phenomenon12 instrument1 image0)
   added: (have_image phenomenon12 image0)
   goals met: 3 of 14
10. (turn_to satellite1 phenomenon10 phenomenon12)
   deleted: (pointing satellite1 phenomenon12)
   added: (pointing satellite1 phenomenon10)
   goals met: 3 of 14
11. (turn_to satellite0 groundstation2 planet8)
   deleted: (pointing satellite0 planet8)
   added: (pointing satellite0 groundstation2)
   goals met: 4 of 14
12. (take_image satellite1 phenomenon10 instrument1 infrared2)
   added: (have_image phenomenon10 infrared2)
   goals met: 5 of 14
13. (turn_to satellite1 planet8 phenomenon10)
   deleted: (pointing satellite1 phenomenon10)
   added: (pointing satellite1 planet8)
   goals met: 5 of 14
14. (take_image satellite1 planet8 instrument1 spectrograph1)
   added: (have_image planet8 spectrograph1)
   goals met: 6 of 14
15. (turn_to satellite1 star6 planet8)
   deleted: (pointing satellite1 planet8)
   added: (pointing satellite1 star6)
   goals met: 6 of 14
16. (take_image satellite1 star6 instrument1 spectrograph1)
   added: (have_image star6 spectrograph1)
   goals met: 7 of 14
17. (turn_to satellite1 star7 star6)
   deleted: (pointing satellite1 star6)
   added: (pointing satellite1 star7)
   goals met: 7 of 14
18. (take_image satellite1 star7 instrument1 spectrograph1)
   added: (have_image star7 spectrograph1)
   goals met: 8 of 14
19. (turn_to satellite1 star9 star7)
   deleted: (pointing satellite1 star7)
   added: (pointing satellite1 star9)
   goals met: 8 of 14
20. (take_image satellite1 star9 instrument1 spectrograph1)
   added: (have_image star9 spectrograph1)
   goals met: 9 of 14
21. (switch_off instrument1 satellite1)
   deleted: (power_on instrument1)
   added: (power_avail satellite1)
   goals met: 9 of 14
22. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 9 of 14
23. (turn_to satellite1 groundstation1 star9)
   deleted: (pointing satellite1 star9)
   added: (pointing satellite1 groundstation1)
   goals met: 9 of 14
24. (calibrate satellite1 instrument2 groundstation1)
   added: (calibrated instrument2)
   goals met: 9 of 14
25. (turn_to satellite1 phenomenon16 groundstation1)
   deleted: (pointing satellite1 groundstation1)
   added: (pointing satellite1 phenomenon16)
   goals met: 9 of 14
26. (take_image satellite1 phenomenon16 instrument2 image3)
   added: (have_image phenomenon16 image3)
   goals met: 10 of 14
27. (turn_to satellite1 planet11 phenomenon16)
   deleted: (pointing satellite1 phenomenon16)
   added: (pointing satellite1 planet11)
   goals met: 10 of 14
28. (take_image satellite1 planet11 instrument2 image3)
   added: (have_image planet11 image3)
   goals met: 11 of 14
29. (turn_to satellite1 planet14 planet11)
   deleted: (pointing satellite1 planet11)
   added: (pointing satellite1 planet14)
   goals met: 11 of 14
30. (take_image satellite1 planet14 instrument2 image3)
   added: (have_image planet14 image3)
   goals met: 12 of 14
31. (turn_to satellite1 star13 planet14)
   deleted: (pointing satellite1 planet14)
   added: (pointing satellite1 star13)
   goals met: 13 of 14
32. (take_image satellite1 star13 instrument2 image3)
   added: (have_image star13 image3)
   goals met: 14 of 14
